{
    "days": [
        {
            "day": 11,
            "events": [
                {
                    "public": true,
                    "starts_at": "14:00",
                    "ends_at": "16:30",
                    "type": "workshop",
                    "title": "Workshop de reverse engineering e segurança de dispositivos IoT",
                    "description": "Neste workshop vai ser apresentado em detalhe o processo de exploração de vulnerabilidades de segurança no relógio TomTom Runner, e como foi possível tirar partido destas para obter acesso ao firmware do relógio e alterá-lo.


                    Será feita uma apresentação das ferramentas e metodologias utilizadas (**gdb**, **python**, **IDA Pro**, **hexedit**), e também da recente ferramenta **Ghidra**, disponibilizada pela NSA para *reverse engineering*.


                    O **Ghidra** será utilizado para fazer um *patch* ao firmware de forma a desbloquear funcionalidades até então escondidas no software.


                    **Requisitos**

                    
                    - Trazer computador pessoal com Linux ou Mac OS",
                    "speaker": "Luís Grangeia",
                    "location": "B113"
                },
                {
                    "public": true,
                    "starts_at": "17:00",
                    "ends_at": "19:00",
                    "type": "talk",
                    "title": "WebAuthn: Goodbye passwords!",
                    "description": "Todos os anos surge novo hardware e software que prometem o fim das passwords tal como as conhecemos. Desde a Apple com leitores de impressões digitais nos iPhones, até à Microsoft com o Windows Hello que suporta reconhecimento facial e biométrico, todas estas inovações prometiam o fim das passwords.\n

Contudo, a realidade é que as passwords ainda não morreram… ou… será que sim? Com WebAuthn está-se muito mais perto de pôr fim às passwords!\n

Nesta palestra irás descobrir o que é a **FIDO** e como a **WebAuthn** já se encontra presente em todos os browsers mais populares, com a missão de **combater phishing** e de **acabar com os métodos de autenticação com passwords** na Web!\n
",
                    "speaker": "José Pedro Silva",
                    "location": "I-105"
                }
            ]
        }, {
            "day": 12,
            "events": [
                {
                    "public": true,
                    "starts_at": "14:30",
                    "ends_at": "16:30",
                    "type": "workshop",
                    "title": "Exploiting Web Vulnerabilities (OWASP Top 10)",
                    "description": "Neste workshop poderás explorar vulnerabilidades do [OWASP Top 10 2017](https://www.owasp.org) com uma aplicação web feita em **Node.js**. Por exemplo:

- Injeção de JavaScript no lado do servidor\n
- Injeção de SQL e NoSQL\n
- Insecure Direct Object References\n

**Requisitos:**

- Um computador portátil pessoal\n
- [Virtual Box](https://www.virtualbox.org/wiki/Downloads) instalado\n
- [Node Goat VM](https://drive.google.com/file/d/18AbutDP2zQNaB-vUoXXJ4QQ6ihog6GW4/view?usp=sharing)\n",
                    "speaker": "Rui Silva | Jscrambler",
                    "location": "I-105"
                }
            ]
        } , {
            "day": 13,
            "events": [
                {
                    "public": true,
                    "starts_at": "14:00",
                    "ends_at": "16:00",
                    "type": "talk",
                    "title": "Connected Cars and V2X security",
                    "description": "Com os avanços da tecnologias e o aparecimento de carros autónomos e redes inteligentes, torna-se fulcral a comunicação entre veículos e a segurança dos dados que são partilhados. Nesta talk serão abordadas as mais recentes inovações no campo dos carros autónomos nomeadamente no campo da comunicação entre veículos. Nos últimos anos a Veniam, uma das 50 mais disruptivas empresas do mundo, tem se dedicado a estes temas acelerando a mobilidade do futuro e criando sistemas e softwares para comunicação entre veículos com grande foco nos veículos autónomos.",
                    "speaker": "Rui Costa | Veniam",
                    "location": "I-105"
                }, {
                    "public": true,
                    "starts_at": "16:00",
                    "ends_at": "16:30",
                    "type": "coffee break",
                    "title": "Networking Session",
                    "description": "Ambiente relaxado onde os participantes poderão entrar em contacto, de uma forma informal e direta, com o orador Rui Costa. Poderás também desfrutar de um **coffee break**",
                    "location": "I-105"
                }
            ]
        },{
            "day": 14,
            "events": [
                {
                    "public": true,
                    "starts_at": "13:30",
                    "ends_at": "16:30",
                    "type": "workshop",
                    "title": "Adversarial Machine Learning",
                    "description": "
A maior parte do que hoje se faz em aprendizagem não considera um atacante motivado, apesar de cada vez mais modelos de negócio e tarefas de segurança serem alicerçados em aprendizagem. Os modelos de ameaça conhecidos para a aprendizagem incluem a criação de amostras adversas para a inferência (*evasion attacks*) e a aprendizagem (*poisoning attacks*), o roubo dos modelos aprendidos (chamadas à API de inferência, ataques *sidechannel* ao hardware de inferência), e a identificação de amostras que foram utilizadas na aprendizagem.\n

Este workshop faz uma introdução prática ao tema da aprendizagem adversa, focada na criação de amostras adversas para a inferência, e dividida nas três partes seguintes:

1. Do Docker ao classificador — instalação de TensorFlow et al. usando Docker; configuração de um classificador e obtenção de resultados de classificação.\n
2. Evitando a deteção — abordagem prática para transformar amostras benignas em amostras malignas parecidas com as benignas, assumindo visão whitebox do classificador.\n
3. Discussão sobre outras técnicas de aprendizagem adversa e outros modelos de ameaça e sobre a aplicação da aprendizagem adversa em vários aspetos da cibersegurança como a deteção de Malware e de tráfego C2C, identificação de texto malicioso, e o reconhecimento facial.",
                    "speaker": "Ricardo Morla",
                    "location": "I321"
                }
            ]
        }
    ]
}